# [RadialGAN](https://arxiv.org/pdf/1802.06403.pdf)

### Category  
GAN, Data augmentation?  
  
### Context  
機械学習には大量のデータが必要だがいつも利用可能とは限らない。  
データセットが少ない場合は違う情報源だが似たような外部データセットを利用するといったことが重要になる。  
本稿ではmultiple GANを用いてあるデータセットから他のデータセットを作り出し、データセットをかさましする。  

複数のソースのデータセットを用いる方法あるけど２つのchallenging!があるんよ  
* feature mismatch  
→例えば医療といった同じフィールドのデータセット間でさえ、データセットごとに実際に記録されている特徴量というものは違ってくる（病院ごとにデータ全然ちゃうとかありえるやん。）  
* distribution mismatch  
→例えば病院ごとに患者の性質(分布)が違うとかありえるやん。(町医者、小児科、総合病院じゃ全然ちゃうやろ)  

→Radial Ganでなんとかするで  
  
### Contribution  
multiple GANを用いてあるデータセットから他のデータセットを作り出し、データセットをかさましする。  
→本来のデータセットを用いるよりも良い精度を実現。  

この論文では複数の情報源からターゲットデータセットを効果的に大きくするためにデータセットを用いるアプローチを示すやで  
具体的には複数のGANを使ってある病院の患者情報をほかの病院の患者情報に作り替えるやでー  
なおその際には、ターゲットとなる病院の患者特性みたいなのもちゃんと考えてるで。  

### Coment  
詳しくは読んでないけど、タスク限定的なのかな？  
一般に使えるならやべーやつだけどそんな感じはしなそうなんだけど。
